//教師データ
var teaching_data=[
  //プロローグ
  //プロローグ　イントロ
  ["本当にこんなところにいるのかな？","そ、そんなこと言わないでよ！今はこれしか方法がないんだから。"],
  ["けど、まさかあやふやな言い伝えだけを頼りにしているとは思わなかったよ。","・・・それでも、今何かをできるのはわたしたちだけだから。"],
  ["それはそうかもしれないけどさ・・・とりあえず、今は休もう。もうふらついているじゃないか。","そんな時間は無いよ！急がないと・・・急いで、召喚士を見つけないと・・・へぶっ。"],
  ["もちろんーー大丈夫？お水でも飲む？","えっと・・・（ぐ〜〜〜〜〜）"],
  ["あはは、ごはんも必要そうだね。","ご、ごめんなさい・・・あなたは？"],
  ["ううん、そんなの気にしないで。はい、どうぞ。","ありがとうございます・・・はぐっ。"],
  ["住んでる私が言うのもなんだけど、なんにも無いところだよ？","・・・わたしたちは、召喚士を探しに来たんです。"],
  ["ごめんね・・・けど、どうして２人は召喚士を探しているの？","・・・呼び出してほしい方々がいるんです。"],
  ["方々って？","クリエメイトです。"],
  ["クリエメイトって・・・あの聖典の？","よくぞご存じで！はい！その通りです！好きですか？好きですよね！大好きです！"],
  ["気にしなくて良いよ。ランプは聖典のことになると止まらなくなっちゃう病気なんだ。","病気じゃない！大好きなだけ！こほん、続けます。"],
  ["じゃあもしかして、召喚士を探しているのは、クリエメイトが好きだから？","ち、違います！もちろん、お話ししてみたいなーとは思いますけど・・・"],
  ["それは・・・今すぐにでも、今この時でも起こるかもしれないの？","・・・何か、気付いたんですか？"],
  ["まさか召喚士を探しに来たらパスを感じられる人に出会うなんてな・・・。","でも、人と人との繋がりを感じられるなんて素敵な力だと思います。"],
  ["・・・この先には私の村があるの。","っ！急ぎましょう！"],
  ["なに・・・あの黒いの・・・？","あれは・・・クロモンです。けど、どうしてこんなところに・・・。"],
  ["様子もおかしい。もしかしたら、その村を襲うつもりかもしれないな・・・。","だとしたら・・・村のみなさんが危ないです！ここで止めないと！"],
  ["でも、どうやって？","それは・・・わかりません。けどっ、見過ごすわけにはいきません！"],
  ["策は・・・どうせランプのことだ、本当に無いんだろうね。","だからって、放っておけるわけないじゃない。クロモンたち・・・止まってくれるかな。"],
  ["・・・止められると信じて動くしかないか。けど、どうするつもりーー","クロモンたち、止まりなさい！"],
  ["くー・・・？（警戒）","・・・止まってくれた？"],
  ["案の定だ！突っ込んでくるよ！早く避けないと・・・ってランプ！？","・・・ここを退くわけにはいきませんから。"],
  //プロローグ　エンド
  ["クロモンが消えていく・・・？","あ・・・あ、ああ、ああああああっ！！！クリエメイト・・・クリエメイトですよ！"],
  ["うう・・・召喚士・・・私が？","そうですよ！だって今、私はクリエメイトに助けてもらったんですから！"],
  ["私が・・・世界を？","はい！その、無理なお願いなのはわかっています・・・それでも、お願いしたいんです！"],
  ["だとしても、禁呪に比べれば簡単だ・・・『アルシーヴ』なら、間違いなくできるだろうね。","っ・・・。"],
  ["その、えっと・・・ランプは私のこと、変な子って思わなかったの？","変な子、ですか？"],
  ["それに、一緒なら頑張れるってーー私もそう思うの。","じゃあーー！！"],

  //1章
  //オーダーとクリエメイト　その1
  ["うん。女神様が私たちに授けてくれているものだよね。","そうです。そして、わたしたちは聖典を読むことで生きる力の源であるクリエを得ています。"],
  ["えっ、う、うん。喋っちゃダメなことなんだね。","・・・このままでは、聖典もいずれ近い未来に無くなってしまいます。"],
  ["無くなる？ど、どうして？","女神様の・・・ソラ様の魂が奪われ、封印されてしまったからです。"],
  ["そんな・・・","詳しいことはわかりません。けれど、誰がやったのかは知っています。"],
  ["・・・もしかして、その人が。","はい。彼女こそがソラ様の魂を奪い、封印した犯人です。わたしは・・・何もできませんでした。"],
  ["けど、そう言っているのはランプだけ。神殿の皆が信じるのは当然、アルシーヴの方だよね・・・。","それでも、わたしたちはアルシーヴを止めなければいけません。そして、ソラ様をお救いするのです。"],
  ["私は・・・その力になれるんだよね。","もちろんです！"],
  //オーダーとクリエメイト　その2
  ["力を・・・借りる？","すっっっっっっごい魔法なんです！伝説の魔法なんです！"],
  ["・・・オーダーって？","クリエメイトの力を借りるのではなく、存在自体を強制的にこの世界へ連れてきてしまう魔法です。"],
  ["っ・・・。","オーダーは・・・強制的に召喚を行うため、どうしても全てに無理を生じさせてしまいます。"],
  ["そっか・・・コールとは違って、その人自身を連れてきてしまうってことは、もしかしたら・・・。","はい・・・そして、クリエメイトは強い力を持つ存在というだけでなく、ソラ様が愛してきた存在です。"],
  ["・・・クリエメイトを愛してるのはランプもだけどね。","・・・わたしの意思としても、クリエメイトを危険な目に遭わせたくないと思っています。"],
  ["・・・え？","い、いるって何がですか？"],
  ["その・・・確証は持てないんだけど、たぶん、この感じ方はクリエメイトなんじゃないかなって。","と、とにかく急ぎましょう！"],
  //オーダーとクリエメイト　その３　イントロ
  ["あれって・・・またクロモンの群れか！？","その奥に誰かいます！あの方々はーー沙英様に乃莉様！？クリエメイトです！"],
  //オーダーとクリエメイト　その４
  ["僕の扱いが雑すぎないか！？","乃莉様たちを驚かせた罰です。"],
  ["だと思います。呼ばれたの私たちだけじゃなかったんですね。","となると・・・ひだまり荘の101号室から203号室までの皆様がこの世界に！"],
  //ヒロたちをさがそう　その１
  ["・・・そっか。ありがとね、ランプ。君がいてくれて良かったよ。","ひゃっ、ひゃい！"],
  ["わっ、そんなにびっくりしなくてもっ。","うう、こういうお方だとわかっていても実際に言われるとドキドキします・・・。"],
  //ヒロたちをさがそう　その２　イントロ
  ["異世界ファンタジーってこと？まだ無いかなぁ。興味がないわけじゃないんだけど・・・。","し、新作の話ですかっ！"],
  ["えっ、ち、違う違う！興味のあるなしの話だから。","・・・残念です。でもっ、興味があるってことは、いつか書くかもしれないってことですよね！"],
  ["え、じゃあ今誰も道がわかってないってこと・・・？・・・どうしようか。","ご、ごめんなさい。お役に立てなくて・・・。"],
  ["あはは、わかんないですよねー。私、けっこう好きなんですけど。","わからなくてすみません！勉強します！"],
  ["いやいやいや書かなくていいよそんなの！","でも、それはいいアイデアなのですよね？"],
  ["そういうこと。ランプたちは、ヒロたちの情報を集めるのに何かいい方法思いつく？","なら・・・絵を描くのはどうでしょうか？似顔絵なら通じると思うんです。"],
  ["絵か・・・いやー、本当にランプは私たちのことをよく知ってるんだね。","大ファンですから！"],
  ["やってみようか。とはいっても、まずは道具が必要だけどね。","それなら、わたしがすぐに集めてきます！"],
  ["お、おい！ランプ！急に走り出すんじゃない！","沙英様たちをお待たせするわけにはいきませんから！"],
  //ヒロたちをさがそう　その３
  ["西にある風車の近くにいたわよ。もしかして、これから行くつもりなの？","はい。"],
  ["なら、急がないとだね。","はい・・・皆様、無事だといいのですが・・・。"],
  //モノクロの空　その１
  ["いいえ、こんな曇り方、私も見るのは初めてです。","わたしも、聞いたことありません・・・。"],
  ["あるといえばあるけど・・・それが何か関係しているの？","これも、禁呪であるオーダーの影響かもしれないと思ったのです。"],
  ["もしかしたら、この空もその影響かもしれないってこと？","はい・・・ただ、かもしれないの話ですから。もう少し考えないとダメですね。"],
  //モノクロの空　その４
  ["気のせいかなって思ってたんだけど・・・やっぱりそうだね。","どうしたんですか？"],
  ["あーやっぱり？しかも、クロモンがまたいるし・・・。","クロモンたち・・・風車小屋の中に入ろうとしてますよね。"],
  ["わっ、クロモンたち、こっちを見てませんか？","気づかれてしまったみたいですね・・・。正面から行きましょう！"],
  //感動の再会　その１
  ["っ！！今、はっきりと感じたよ！この中に、2人がいます！","クロモンで隠れていましたが、扉もここに！"],
  ["女神様も沙英さんたちのこと知ってるの？","もちろんです！私ではまったく敵わないほどお詳しいです！"],
  //ランプの日記帳　その１
  ["ランプちゃんはどうやって私たちのことを知ったの？","それはもうたくさん見てきましたので！"],
  ["察しが良くて助かるよ・・・そう、その世界のひとつが乃莉たちの世界なんだ。","ソラ様はすごいのです。こんなに素敵な世界をたくさん、見てきているのですから！"],
  ["普通はそういうものだよ。ランプが読み込みすぎてるだけなんだ。","すごく素敵な世界ばかりですから。ああっ、わたしもひだまり荘に住んでみたいです。"],
  ["それは？","日記のようなものです。色んな出来事を残すようにしておきなさいと教えられてますから。"],
  ["・・・それってもしかして、さっき私のお腹が鳴っちゃったことも？","もちろんです！"],
  ["私もそれは消してあげた方が良いかなって思うけど・・・","でも、かけがえのない出来事ですから！"],
  //跡をたどって　その１
  ["奇遇だね・・・私も、少し前に似た光景を見たよ・・・。","や、やっぱりクロモンです！なんでこんなにいるんですかー！"],
  //跡をたどって　その５
  ["それに、なんでランプはアルシーヴ様の邪魔をするの？","・・・間違っていると思うからです。オーダーなんて、言語道断です！"],
  ["クリエって・・・奪えるものなんですか？","・・・わたしは知りません。けど、アルシーヴならその方法を知っているのかもしれません。"],
  //七賢者・シュガー　その２
  ["沙英さん・・・ありがとうございます。私も、一緒に探します。","どこから探しましょうか、バラバラになって探したほうが早いでしょうけど危ないし・・・。"],
  //七賢者・シュガー　その３
  ["ランプ、落ち着きな。","・・・ご、ごめんなさい。でも、やっぱり思います。アルシーヴは間違っているって。"],
  //また会う日まで
  ["とにかく、これで一件落着ってやつかな？","そうですね・・・おそらく、この辺りのクロモンを操っていたのもシュガーのはずですから。"],
  ["・・・でもその鍵、そのまま持って行かれちゃってるような・・・。","そう、ですね・・・。"],
  ["あ、それはシュガーちゃんも言ってました。この中にいれば何の心配もないんだって。","もっと情報がないと・・・他に何か、シュガーは言っていませんでしたか？"],
  ["わぁ・・・。","っ！開きました！"],
  ["いいことなんじゃないかな。ね、ランプ。","・・・うん、そうだね。"],
  ["・・・ランプ？","ごめんなさい、少し・・・。ちょっと懐かしくなっちゃって。"],
  ["どうしてこのタイミングで・・・？","さっき、クリエケージを破壊したからだと思います。"],
  ["その、本当に記憶も消えちゃうのかしら？","実際にどうなるかはわかりませんが、おそらくは・・・。"],
  ["無理矢理じゃなくて、私たちを呼んでくれる力を。","あーー。"],
  ["あーまぁこうなるよね。","もちろん、皆様を助けて元の世界に帰さなきゃいけないってわかってます。"],

  //２章
  //新たな出会い　その１
  ["い、今・・・パスを感じたの！","えっ！？どっちの方からですか！？"],
  //新たな出会い　その３
  ["パスが今、ひときわ強く感じられて・・・。ええと、そこに・・・！","えっ・・・あ、あれは！？"],
  //新たな出会い　その４
  ["あれは・・・女の子が3人？・・・1人は、小さい子みたいだけど。","本当ですね・・・って、あ、あの方たちはっ！！もしかして、青葉様とひふみ様じゃっ！？"],
  ["ここって一体どこなんでしょう？・・・って、今、私の名前をっ？","はいっ！不肖このわたくしから説明させていただきますっ。"],

  //エトワリアのサンタクロース
  //クリスマスってなに？
  ["ランプに引っ張ってこられたので、実は何もわからないんです・・・。","クリスマスといえば、クリエメイトのみなさんの世界では、毎年恒例のお祭りなんですよ！"],
  ["へぇ・・・。","その日は必ず、家族や友達、恋人と過ごさないと、災いがふりかかると言われているほどです。"],
  ["そ、そうなの？","はい。正しくはサン・タクロースと言って、古くからの伝承上の人物です。"],
  ["うーん。それほどかなあ・・・？","とにかくクリスマスには贈り物の風習があって、それがサンタの役割なんですよ。"],

  //キャラシナリオ　ランプ　シングル
  //他人に日記を読まれる危険
  ["呼吸を乱しながら日記を書く人は初めて見たよ・・・ランプは本当にクリエメイトが好きなんだね。","はい！憧れの存在ですっ！"],
  ["興奮して書いているせいで誤字脱字が多いんだよ・・・困ったもんだ。","うぐっ・・・それは・・・。"],
  ["あんなに楽しそうに書いてるんだもん。どんなこと書いてるのか気になっちゃうよ。","ええ！？それはちょっと恥ずかしいような・・・。ううっ・・・でも・・・。"],
  ["・・・。（わくわく）","わ、わかりました・・・！"],
  ["・・・か、かわいい文章の日記だね。","やっぱり子供っぽいでしょうか・・・。"],
  ["ーーんん？","ど、どうしましたっ！？"],
  ["そういう時の描写だけ、文章の熱量が他と全然違う・・・？","す、好きなものや憧れているものを書く時は夢中になってしまうんですっ！！"],
  ["ーーあれ？この子は誰のことだろ？『ーーお星様だと思った』","あ、それは・・・！"],
  ["きっと、このクリエメイトが大好きなんだね。でも・・・、誰の事だろ。わからなかったよ。","えっと、その・・・。"],
  ["・・・あ、私のことだったんだ。","はい・・・。その・・・、尊敬してます・・・。"],
  ["あ、ありがと・・・。","はい・・・。"],
  //気高き女神候補生の相棒
  ["まぁた聖典かい！？もっと色んな勉強をしないとダメだろう！？","そ、そうだけど〜・・・。"],
  ["ランプはちゃんと反省して謝りたいってことなのかな？","謝りたいというよりも・・・、今はお礼が言いたいです。"],
  ["やあランプ。久しぶりだね。お昼ぶりだ。","か、隠れて見てたの！？どこから！？"],
  ["ランプが反省して他の学科の勉強に取り掛かるところからだよ。","最初っからじゃない！ていうか家出してないじゃない！"],
  ["僕のことが心配で心配で、夕ご飯も食べずに探し回ってたんだろ？素直じゃないなあ。","ムキー！！生意気な！言っとくけど、そんな生意気でいられるのは今のうちだけだよ！"]
];
