//教師データ
var teaching_data=[
  //プロローグ　イントロ
  ["本当にこんなところにいるのかな？","そ、そんなこと言わないでよ！今はこれしか方法がないんだから。"],
  ["けど、まさかあやふやな言い伝えだけを頼りにしているとは思わなかったよ。","・・・それでも、今何かをできるのはわたしたちだけだから。"],
  ["それはそうかもしれないけどさ・・・とりあえず、今は休もう。もうふらついているじゃないか。","そんな時間は無いよ！急がないと・・・急いで、召喚士を見つけないと・・・へぶっ。"],
  ["もちろんーー大丈夫？お水でも飲む？","えっと・・・（ぐ〜〜〜〜〜）"],
  ["あはは、ごはんも必要そうだね。","ご、ごめんなさい・・・あなたは？"],
  ["ううん、そんなの気にしないで。はい、どうぞ。","ありがとうございます・・・はぐっ。"],
  ["住んでる私が言うのもなんだけど、なんにも無いところだよ？","・・・わたしたちは、召喚士を探しに来たんです。"],
  ["ごめんね・・・けど、どうして２人は召喚士を探しているの？","・・・呼び出してほしい方々がいるんです。"],
  ["方々って？","クリエメイトです。"],
  ["クリエメイトって・・・あの聖典の？","よくぞご存じで！はい！その通りです！好きですか？好きですよね！大好きです！"],
  ["気にしなくて良いよ。ランプは聖典のことになると止まらなくなっちゃう病気なんだ。","病気じゃない！大好きなだけ！こほん、続けます。"],
  ["じゃあもしかして、召喚士を探しているのは、クリエメイトが好きだから？","ち、違います！もちろん、お話ししてみたいなーとは思いますけど・・・"],
  ["それは・・・今すぐにでも、今この時でも起こるかもしれないの？","・・・何か、気付いたんですか？"],
  ["まさか召喚士を探しに来たらパスを感じられる人に出会うなんてな・・・。","でも、人と人との繋がりを感じられるなんて素敵な力だと思います。"],
  ["・・・この先には私の村があるの。","っ！急ぎましょう！"],
  ["なに・・・あの黒いの・・・？","あれは・・・クロモンです。けど、どうしてこんなところに・・・。"],
  ["様子もおかしい。もしかしたら、その村を襲うつもりかもしれないな・・・。","だとしたら・・・村のみなさんが危ないです！ここで止めないと！"],
  ["でも、どうやって？","それは・・・わかりません。けどっ、見過ごすわけにはいきません！"],
  ["策は・・・どうせランプのことだ、本当に無いんだろうね。","だからって、放っておけるわけないじゃない。クロモンたち・・・止まってくれるかな。"],
  ["・・・止められると信じて動くしかないか。けど、どうするつもりーー","クロモンたち、止まりなさい！"],
  ["くー・・・？（警戒）","・・・止まってくれた？"],
  ["案の定だ！突っ込んでくるよ！早く避けないと・・・ってランプ！？","・・・ここを退くわけにはいきませんから。"],
  //プロローグ　エンド
  ["クロモンが消えていく・・・？","あ・・・あ、ああ、ああああああっ！！！クリエメイト・・・クリエメイトですよ！"],
  ["うう・・・召喚士・・・私が？","そうですよ！だって今、私はクリエメイトに助けてもらったんですから！"],
  ["私が・・・世界を？","はい！その、無理なお願いなのはわかっています・・・それでも、お願いしたいんです！"],
  ["だとしても、禁呪に比べれば簡単だ・・・『アルシーヴ』なら、間違いなくできるだろうね。","っ・・・。"],
  ["その、えっと・・・ランプは私のこと、変な子って思わなかったの？","変な子、ですか？"],
  ["それに、一緒なら頑張れるってーー私もそう思うの。","じゃあーー！！"],

  //オーダーとクリエメイト　その1
  ["うん。女神様が私たちに授けてくれているものだよね。","そうです。そして、わたしたちは聖典を読むことで生きる力の源であるクリエを得ています。"],
  ["えっ、う、うん。喋っちゃダメなことなんだね。","・・・このままでは、聖典もいずれ近い未来に無くなってしまいます。"],
  ["無くなる？ど、どうして？","女神様の・・・ソラ様の魂が奪われ、封印されてしまったからです。"],
  ["そんな・・・","詳しいことはわかりません。けれど、誰がやったのかは知っています。"],
  ["・・・もしかして、その人が。","はい。彼女こそがソラ様の魂を奪い、封印した犯人です。わたしは・・・何もできませんでした。"],
  ["けど、そう言っているのはランプだけ。神殿の皆が信じるのは当然、アルシーヴの方だよね・・・。","それでも、わたしたちはアルシーヴを止めなければいけません。そして、ソラ様をお救いするのです。"],
  ["私は・・・その力になれるんだよね。","もちろんです！"]
  //オーダーとクリエメイト　その2
];
